test/stubs/v2/delete_shipment_order_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:bcs="http://dhl.de/webservices/businesscustomershipping" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:cis="http://dhl.de/webservice/cisbase" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <env:Header>
    <cis:Authentification>
      <cis:user>2222222222_01</cis:user>
      <cis:signature>pass</cis:signature>
      <cis:type>0</cis:type>
    </cis:Authentification>
  </env:Header>
  <env:Body>
    <bcs:DeleteShipmentOrderRequest>
      <bcs:Version>
        <majorRelease>2</majorRelease>
        <minorRelease>0</minorRelease>
      </bcs:Version>
      <cis:shipmentNumber>22222222901010000951</cis:shipmentNumber>
    </bcs:DeleteShipmentOrderRequest>
  </env:Body>
</env:Envelope>
